Revit 2026 API

# RebarGetRebarSplice Method

---

Gets the rebar splice at the specified bar end - 0 for start, 1 for end.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RebarSplice GetRebarSplice(
	int barEnd
)
```
```vb
Public Function GetRebarSplice (
	barEnd As Integer
) As RebarSplice
```
```cpp
public:
RebarSplice^ GetRebarSplice(
	int barEnd
)
```
```fsharp
member GetRebarSplice :
        barEnd : int -> RebarSplice
```

#### Parameters

barEnd Int32
     The bar end for which the rebar splice is needed - 0 for start, 1 for end.

#### Return Value

RebarSplice Returns the rebar splice at the specified bar end - 0 for start, 1 for end.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | barEnd must be 0 or 1. |

In order to splice a rebar or unify existing spliced rebars there are utility functions in RebarSpliceUtils class.

#### Reference

Rebar Class

Autodesk.Revit.DB.Structure Namespace